const { getButtonsForSection } = require('../../services/sectionService');

function customerCareResponse(msg) {
    let responseText = '';
    let buttons = [];

    if (msg.includes('පාරිභෝගික සේවාව')) {
        responseText = [
            "🎉 வாடிக்கையாளர் பராமரிப்புப் பிரிவைத் தேர்ந்தெடுத்ததற்கு நன்றி!",
            "🤗 உங்கள் அனுபவத்தைத் தடையற்றதாகவும், தகவலறிந்ததாகவும் மாற்ற நான் இங்கு வந்துள்ளேன். எங்கள் சேவைகளைப் பற்றி உங்களுக்கு ஏதேனும் கேள்விகள் இருந்தாலோ, இணையதளத்தில் வழிசெலுத்துவதற்கு உதவி தேவைப்பட்டாலோ, அல்லது மருத்துவரைக் கண்டறிய விரும்பினாலும், நான் ஒரு செய்தியில் இருக்கிறேன்!",
            "💬 இன்று இணைய வழிசெலுத்தல் அல்லது ஏதேனும் விசாரணைகளில் நான் உங்களுக்கு எப்படி உதவ முடியும்?"
            ];
        buttons = getButtonsForSection('englishCustomerCare'); 

    } else if (msg.includes('නිති අසන පැන')) {
        responseText = [
            "📖 அடிக்கடி கேட்கப்படும் கேள்விகள் பகுதிக்கு வரவேற்கிறோம்!",
            "உங்கள் அடிக்கடி கேட்கப்படும் கேள்விகளுக்குப் பதிலளிப்பதற்காகவும், உங்களிடம் ஏதேனும் குறிப்பிட்ட கேள்விகளுக்கு வழிகாட்டுதலை வழங்கவும் நான் இங்கு வந்துள்ளேன்.",
            "🔎 நீங்கள் இன்று எதைப் பற்றி தெரிந்து கொள்ள விரும்புகிறீர்கள்?"
            ];
        buttons = getButtonsForSection('sinhalaRegister');

    } else if (msg.includes('නියෝජිතයා සමඟ කතා කරන්න')) {
        responseText = [
            "📞 ஒரு பிரதிநிதியுடன் உங்களை இணைக்கிறேன்!",
            "இடைவெளியைக் குறைக்கவும், தனிப்பயனாக்கப்பட்ட உதவிக்காக உங்களை எங்கள் ஆதரவுக் குழுவுடன் இணைக்கவும் நான் இங்கு வந்துள்ளேன்.",
            "💬 உங்களை இணைப்பதற்கு முன் நான் எப்படி உங்களுக்கு உதவ முடியும்?"
            ];
        buttons = getButtonsForSection('sinhalaRegister');

    }
    
    return { responseText, buttons };
}

module.exports = { customerCareResponse };
